
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Команда",мКоманда);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьИПередать(Команда)
	мПараметры = новый Структура("Команда,ДопПараметр",мКоманда,ДопПараметр);
	Оповестить("Editor",мПараметры);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВебАдресПриИзменении(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ВставитьКартинкуВеб(Команда)
	Если НЕ ЗначениеЗаполнено(ВебАдрес) Тогда
		Сообщить("Адрес не указан!");
		Возврат;
	КонецЕсли;  	
	HTML="<!DOCTYPE html><html><head></head><body><img src='"+ВебАдрес+"' /></body></html>";
КонецПроцедуры

&НаКлиенте
Процедура ВставитьКартинкуФайлНаДиске(Команда)
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Файл не указан!");
		Возврат;
	КонецЕсли;                   
	Файл = Новый Файл(ПутьКФайлу);
	Если НЕ Файл.Существует() Тогда
		Сообщить("Не верное имя файла!");
		Возврат;
	КонецЕсли;
		
	HTML="
    |<!DOCTYPE html>
    |<html>
    |<center>
    |";
    HTML=HTML+"
    |<img src=""data:image/jpeg;base64,
    |";
    HTML=HTML+Base64Строка(Новый ДвоичныеДанные(ПутьКФайлу));
    HTML=HTML+"
    |"" style=""max-width:100%; height:auto""; align-items:center; alt="""" />
    |</center>
    |</html>
    |";
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Диалог.Заголовок = "Выберите изображение"; 
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "любой-файл (*.*)|*.*"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь; 
	ВыборФайлаОткрытияКартинки = новый ОписаниеОповещения("ВыборФайлаОткрытияКартинки",ЭтотОбъект);
	Диалог.Показать(ВыборФайлаОткрытияКартинки);
КонецПроцедуры                                


&НаКлиенте
Процедура ВыборФайлаОткрытияКартинки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	 Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0]; 
	КонецЕсли; 
	
КонецПроцедуры  


