
Функция ПолучитьОтличияФайловРасчетИзменений(Сценарий,Ключ) Экспорт
	
	ДанныеОтличий= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПримИзм.Текст КАК Текст,
	|	ПримИзм.ТипИзменений КАК ТипИзменений,
	|	ПримИзм.ИмяФункции КАК ИмяФункции,
	|	ПримИзм.Проблема КАК Проблема,
	|	ПримИзм.ТипПроблемы КАК ТипПроблемы,
	|	ПримИзм.Длина КАК Длина,
	|	ПримИзм.UID КАК UID
	|ИЗ
	|	РегистрСведений.РасчетИзмененийКонфигураций КАК ПримИзм
	|ГДЕ
	|	ПримИзм.Сценарий = &Сценарий
	|	И ПримИзм.Ключ = &Ключ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПримИзм.ОтНачалаФайла,
	|	ВЫБОР
	|		КОГДА ПримИзм.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление)
	|			ТОГДА 1
	|		КОГДА ПримИзм.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка)
	|			ТОГДА 2
	|		ИНАЧЕ 10
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = Новый Структура("Текст,ТипИзменений,ИмяФункции,Проблема,ТипПроблемы,Длина,UID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Выборка);
		ДанныеОтличий.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат ДанныеОтличий;
	
КонецФункции

Функция ПолучитьИсходныйБазовыйНовыйФайл(Сценарий,Ключ) Экспорт
	
	ДанныеОтличий= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПримИзм.Текст КАК Текст,
	|	ПримИзм.ТипИзменений КАК ТипИзменений,
	|	ПримИзм.ИмяФункции КАК ИмяФункции,
	|	ПримИзм.Проблема КАК Проблема,
	|	ПримИзм.ТипПроблемы КАК ТипПроблемы,
	|	ПримИзм.Длина КАК Длина,
	|	ПримИзм.UID КАК UID
	|ИЗ
	|	РегистрСведений.РасчетИзмененийКонфигураций КАК ПримИзм
	|ГДЕ
	|	ПримИзм.Сценарий = &Сценарий
	|	И ПримИзм.Ключ = &Ключ
	|	И ПримИзм.ТипИзменений В (ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Совпадение), ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПримИзм.ОтНачалаФайла,
	|	ВЫБОР
	|		КОГДА ПримИзм.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление)
	|			ТОГДА 1
	|		КОГДА ПримИзм.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка)
	|			ТОГДА 2
	|		ИНАЧЕ 10
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = Новый Структура("Текст,ТипИзменений,ИмяФункции,Проблема,ТипПроблемы,Длина,UID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Выборка);
		ДанныеОтличий.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат ДанныеОтличий;
	
КонецФункции
