
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьОтображениеПоТипу();
КонецПроцедуры



&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ИзменитьОтображениеПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеПоТипу()
	
	Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.Файл") 
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ВнешнийОтчет")
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ВнешняяОбработка")Тогда
		Элементы.ГруппаНумерация.Видимость=Ложь;
	Иначе
		Элементы.ГруппаНумерация.Видимость=Истина;
	КонецЕсли;
	
	Если Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.Справочник") 
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ПланСчетов")
		ИЛИ Объект.Тип=ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ПланВидовХарактеристик") Тогда
		Элементы.ГруппаИерархия.Видимость=Истина;
	Иначе
		Элементы.ГруппаИерархия.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры

