
&НаКлиенте
Процедура ПоказатьОтличияИзмененнойОтБазовой(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	ДанныеОтличий = ПолучитьОтличияФайловСравнение(ТекущиеДанные.Сценарий,ТекущиеДанные.Ключ);
	
	КлючФормы = Новый UUID();
	мПараметры = новый Структура();
	мПараметры.Вставить("АдресВоВременномХранилище",ПередатьДанныеВоВнешнююФорму(ДанныеОтличий));
	мПараметры.Вставить("diff_api","diff");
	мПараметры.Вставить("diff_inline",Истина);
	мПараметры.Вставить("КлючФормы",КлючФормы);
	мПараметры.Вставить("ЗаголовокФормы","сравнение: "+ТекущиеДанные.Ключ+" - текущие отличия");
	мПараметры.Вставить("Ключ",ТекущиеДанные.Ключ);
	мПараметры.Вставить("Сценарий",ТекущиеДанные.Сценарий);
	
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаСравненияФайловWebInline",мПараметры,ЭтаФорма,КлючФормы);	
	
	Форма.Открыть();
	Оповестить("diff_изменение",мПараметры,ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьПланируемуюВставку(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	ДанныеОтличий = ПолучитьОтличияФайловРасчетИзменений(ТекущиеДанные.Сценарий,ТекущиеДанные.Ключ);
	
	КлючФормы = Новый UUID();	
	мПараметры = новый Структура();
	мПараметры.Вставить("АдресВоВременномХранилище",ПередатьДанныеВоВнешнююФорму(ДанныеОтличий));
	мПараметры.Вставить("diff_api","diff");
	мПараметры.Вставить("diff_inline",Истина);
	мПараметры.Вставить("КлючФормы",КлючФормы);
	мПараметры.Вставить("ЗаголовокФормы","расчет: "+ТекущиеДанные.Ключ+" - текущие отличия");
	мПараметры.Вставить("Ключ",ТекущиеДанные.Ключ);
	мПараметры.Вставить("Сценарий",ТекущиеДанные.Сценарий);
	
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаСравненияФайловWebInline",мПараметры,ЭтаФорма,КлючФормы);	
	
	Форма.Открыть();
	Оповестить("diff_изменение",мПараметры,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Функция ПередатьДанныеВоВнешнююФорму(МассивДанных)
	
	мСтруктура = новый Структура();
	мСтруктура.Вставить("МассивДанных",МассивДанных);

	Возврат ПоместитьВоВременноеХранилище(мСтруктура);
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьОтличияФайловСравнение(Сценарий,Ключ)
	
	Возврат РегистрыСведений.СравнениеКонфигураций.ПолучитьОтличияФайловСравнение(Сценарий,Ключ);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтличияФайловРасчетИзменений(Сценарий,Ключ)
	
	Возврат РегистрыСведений.РасчетИзмененийКонфигураций.ПолучитьОтличияФайловРасчетИзменений(Сценарий,Ключ);
	
КонецФункции
