
Функция ПолучитьОтличияФайловСравнение(Сценарий,Ключ) Экспорт
	
	ДанныеОтличий= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Срав.Текст КАК Текст,
	|	Срав.ИмяФункции КАК ИмяФункции,
	|	Срав.ТипИзменений КАК ТипИзменений,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА """"
	|		ИНАЧЕ Срав.Проблема
	|	КОНЕЦ КАК Проблема,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Порядок)
	|		ИНАЧЕ Срав.ТипПроблемы
	|	КОНЕЦ КАК ТипПроблемы,
	|	Срав.Длина КАК Длина,
	|	Срав.UID КАК UID
	|ИЗ
	|	РегистрСведений.СравнениеКонфигураций КАК Срав
	|ГДЕ
	|	Срав.Сценарий = &Сценарий
	|	И Срав.Ключ = &Ключ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Срав.ОтНачалаФайла,
	|	ВЫБОР
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление)
	|			ТОГДА 1
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка)
	|			ТОГДА 2
	|		ИНАЧЕ 10
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = Новый Структура("Текст,ТипИзменений,ИмяФункции,ТипПроблемы,Проблема,Длина,UID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Выборка);
		ДанныеОтличий.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат ДанныеОтличий;
	
КонецФункции




Функция ПолучитьИсходныйБазовыйФайл(Сценарий,Ключ) Экспорт
	
	ДанныеОтличий= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Срав.Текст КАК Текст,
	|	Срав.ИмяФункции КАК ИмяФункции,
	|	Срав.ТипИзменений КАК ТипИзменений,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА """"
	|		ИНАЧЕ Срав.Проблема
	|	КОНЕЦ КАК Проблема,
	|	ВЫБОР
	|		КОГДА Срав.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.Обработан)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Порядок)
	|		ИНАЧЕ Срав.ТипПроблемы
	|	КОНЕЦ КАК ТипПроблемы,
	|	Срав.Длина КАК Длина,
	|	Срав.UID КАК UID
	|ИЗ
	|	РегистрСведений.СравнениеКонфигураций КАК Срав
	|ГДЕ
	|	Срав.Сценарий = &Сценарий
	|	И Срав.Ключ = &Ключ
	|	И Срав.ТипИзменений В (ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Совпадение), ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Срав.ОтНачалаФайла,
	|	ВЫБОР
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление)
	|			ТОГДА 1
	|		КОГДА Срав.ТипИзменений = ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка)
	|			ТОГДА 2
	|		ИНАЧЕ 10
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = Новый Структура("Текст,ТипИзменений,ИмяФункции,ТипПроблемы,Проблема,Длина,UID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Выборка);
		ДанныеОтличий.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат ДанныеОтличий;
	
КонецФункции

