&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюСвойств();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюСвойств()     
	
	Если НЕ ЗначениеЗаполнено(Запись.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	МРез = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(Запись.Ключ,"ЭтоЧисло,ЭтоСтрока,ЭтоБулево");
	
	Элементы.ЗначениеБулево.Видимость = МРез.ЭтоБулево;
	Элементы.ЗначениеЧисло.Видимость = МРез.ЭтоЧисло;
	Элементы.ЗначениеСтрока.Видимость = МРез.ЭтоСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючПриИзменении(Элемент)
	УправлениеВидимостьюСвойств();
КонецПроцедуры
