
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сценарий = Параметры.Сценарий;
	
	Дата = ТекущаяДата();
	
	// Сформируем запрос с данными    
	СформироватьТаблицуПроблем();
	
КонецПроцедуры   

&НаСервере
Процедура СформироватьТаблицуПроблем()
	
	МассивПроблем = ПолучитьСписокПроблем(Сценарий);
	
	ТаблицаПланируемыхЗадач.Очистить();
	
	Для Каждого стр из МассивПроблем Цикл
		стр_н = ТаблицаПланируемыхЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(стр_н,стр);
		стр_н.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОбработки.ТребуетсяОбработка");
		стр_н.Приоритет = ПредопределенноеЗначение("Перечисление.Приоритеты.Основной");
		Если ЗначениеЗаполнено(Дата) Тогда
			стр_н.Дата = Дата;
		Иначе
			стр_н.Дата = ТекущаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(Ответственный) Тогда
			стр_н.Ответственный = Ответственный;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПроблем(Сценарий)
	
	МассивПроблем = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СравнениеКонфигураций.Сценарий КАК Сценарий,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации.Конфигурация КАК Конфигурация,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации КАК СвойствоОбъектаКонфигурации
	|ИЗ
	|	РегистрСведений.СравнениеКонфигураций КАК СравнениеКонфигураций
	|ГДЕ
	|	СравнениеКонфигураций.Сценарий = &Сценарий
	|	И СравнениеКонфигураций.ТипИзменений В (ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка), ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление), ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Замена))
	|	И СравнениеКонфигураций.ТипПроблемы В (ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Ошибка), ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Предупреждение))
	|
	|СГРУППИРОВАТЬ ПО
	|	СравнениеКонфигураций.МодульБазовойКонфигурации,
	|	СравнениеКонфигураций.Сценарий,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации.Конфигурация";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураПроблемы = Новый Структура("Сценарий,Конфигурация,ОбъектКонфигурации,СвойствоОбъектаКонфигурации");
		ЗаполнитьЗначенияСвойств(СтруктураПроблемы,Выборка);
		МассивПроблем.Добавить(СтруктураПроблемы);
	КонецЦикла;
	
	Возврат МассивПроблем;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаборЗадач(Команда)
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сообщить("Укажите сценарий сначала!");
		Возврат;
	КонецЕсли;
	СоздатьНаборЗадачСервер();
КонецПроцедуры     

&НаСервере
Процедура СоздатьНаборЗадачСервер()   
	
	Для каждого стр из ТаблицаПланируемыхЗадач Цикл
		
		МенеджерЗаписи = РегистрыСведений.ОбработанныеОбъектыКонфигурации.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,стр);
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТаблицу(Команда)
	СформироватьТаблицуПроблем();
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьОтветственного(Команда)
	Для каждого стр из Элементы.ТаблицаПланируемыхЗадач.ВыделенныеСтроки Цикл
		строка_пз = ТаблицаПланируемыхЗадач.Получить(стр);
		Если НЕ строка_пз=Неопределено Тогда
			строка_пз.Ответственный = Ответственный;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
