

Функция ПолучитьДанныеИсходныеИзменения(Сценарий,Ключ) Экспорт
	Возврат ОбработкаИзмененийКонфигурацийСервер.ПолучитьДанныеИсходныеИзменения(Сценарий,Ключ);
КонецФункции     

Функция ПолучитьДанныеРассчитанныеИзменения(Сценарий,Ключ=Неопределено) Экспорт
	Возврат ОбработкаИзмененийКонфигурацийСервер.ПолучитьДанныеРассчитанныеИзменения(Сценарий,Ключ);
КонецФункции                                     

Функция ПолучитьДанныеРассчитанныеИзмененияСУчетомРучнойПравки(Сценарий,Ключ=Неопределено) Экспорт
	Возврат ОбработкаИзмененийКонфигурацийСервер.ПолучитьДанныеРассчитанныеИзмененияСУчетомРучнойПравки(Сценарий,Ключ);
КонецФункции                                     


Процедура ПроставитьСтатусОбработаноПоUID(Сценарий,Ключ,UID) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ПроставитьСтатусОбработаноПоUID(Сценарий,Ключ,UID);
КонецПроцедуры

Процедура ОчиститьСтарыеЗаписиПоРегиструИзменений(Знач Сценарий,Знач Ключ=Неопределено) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ОчиститьСтарыеЗаписиПоРегиструИзменений(Сценарий,Ключ);	
КонецПроцедуры

Процедура ЗаписатьНовыеДанныеПоРегиструИзменений(Сценарий,Ключ,НовыеДанные) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ЗаписатьНовыеДанныеПоРегиструИзменений(Сценарий,Ключ,НовыеДанные);	
КонецПроцедуры    

Процедура ЗаписатьЕслиЕстьПроблемыПоРегиструСравнения(Сценарий,Ключ,ИзмененныеДанные) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ЗаписатьЕслиЕстьПроблемыПоРегиструСравнения(Сценарий,Ключ,ИзмененныеДанные);	
КонецПроцедуры


Процедура ОчиститьСтарыеЗаписиПоРегиструСравнения(Знач Сценарий,Знач Ключ=Неопределено) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ОчиститьСтарыеЗаписиПоРегиструСравнения(Сценарий,Ключ);	
КонецПроцедуры

Процедура ЗаписатьНовыеДанныеПоРегиструСравнения(Сценарий,Ключ,НовыеДанные) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ЗаписатьНовыеДанныеПоРегиструСравнения(Сценарий,Ключ,НовыеДанные);	
КонецПроцедуры

Процедура ЗаписатьНовыеДанныеПоРегиструЗадания(Сценарий,НовыеДанные) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ЗаписатьНовыеДанныеПоРегиструЗадания(Сценарий,НовыеДанные);
КонецПроцедуры

Процедура ОбновитьДанныеПоРегиструЗадания(Сценарий,НовыеДанные) Экспорт
	ОбработкаИзмененийКонфигурацийСервер.ОбновитьДанныеПоРегиструЗадания(Сценарий,НовыеДанные);
КонецПроцедуры

Функция ПолучитьХеш(str)	Экспорт
	Хеш = новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(str);
	Возврат Хеш.ХешСумма;	
КонецФункции


Функция ПолучитьМассивФайловДляОбработки(Сценарий,МассивКлючей) Экспорт
	Возврат ОбработкаИзмененийКонфигурацийСервер.ПолучитьМассивФайловДляОбработки(Сценарий,МассивКлючей);
КонецФункции

Функция ПолучитьПредставлениеКлючИзмененияСтрокой(ТипИзменений,Позиция) Экспорт
	Возврат ОбработкаИзмененийКонфигурацийСервер.ПолучитьПредставлениеКлючИзмененияСтрокой(ТипИзменений,Позиция);	
КонецФункции


Функция ПолучитьИнформациюПоДобавлениюКомментариев() Экспорт
	Возврат  ОбработкаИзмененийКонфигурацийСервер.ПолучитьИнформациюПоДобавлениюКомментариев();
КонецФункции